package com.github.artemzi.hw07;

/**
 * Работаем с проектом из Урока 3
 *
 * 1.      Создать прокси для класса mathBox (подумайте, что для этого надо добавить к классу)
 *
 * 2.      В вызов методов класса через прокси добавить логирование в консоль при использовании аннотации Logged
 *
 * 3.      В вызов методов класса через прокси добавить очистку поля-контейнера при использовании аннотации ClearData у вызванного метода
 *
 * Нужные аннотации добавить к проекту
 */
public class Main {
    public static void main(String[] args) {
        System.out.println("It works!");
    }
}
