package com.github.artemzi.hw09;

/**
 * Разработать клиент-серверный чат
 * 1. Система состоит из двух приложений: клиента и сервера
 * 2. В рантайме может быть любое количество экземпляров клиента. При старте каждому присваивается идентификатор
 * 3. Клиент из консоли отправляет сообщения, которые получают все остальные клиенты и выводят у себя в консоль
 * 4. Сервер отвечает за координацию клиентов и присвоение им идентификаторов
 * 5. Сервер в консоли логирует все сообщения всех клиентов
 */
public class Chat {
    public static void main(String[] args) {
        System.out.println("Chat works!");
    }
}
